////////////////////////////////////////////////////////////////////////////////
//                                                                            //
//                           Форматизатор исходников                          //
//                                                                            //
//                    Заглавный модуль Postgres-синтаксиса                    //
//                                                                            //
//               Copyright(c) 2019-2024 by Sanders the Softwarer              //
//                                                                            //
////////////////////////////////////////////////////////////////////////////////

unit PostgresCore;

{ ----- Примечания -------------------------------------------------------------

  Модули, описывающие синтаксис Postgres, самостоятельно регистрируются в
  парсере. Единственное, что для этого нужно - указать их в предложении uses

------------------------------------------------------------------------------ }

interface

uses Parser;

{ Парсер для Postgres синтаксиса }
function PostgresParser: TParserInfo;

implementation

uses PostgresDDL;

{ Парсер для Postgres синтаксиса }
function PostgresParser: TParserInfo;
begin
  Result := TParserInfo.InstanceFor('Postgres');
end;

end.
